cask_args appdir: '/Applications'
tap 'homebrew/cask'
brew 'mas'
# Install GNU core utilities (those that come with OS X are outdated)
# Don’t forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew 'coreutils'
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'
# Install Bash 4
brew 'bash'

# Install wget with IRI support
brew 'wget', args: ['enable-iri']




#Dev tools
cask 'intellij-idea'
cask 'sublime-text'
cask 'java'
brew 'maven'

# Identity
cask 'keybase'
brew 'gpg'

#Virtualisation
cask 'vagrant'
cask 'virtualbox'

#Other...
cask 'deckset'
cask 'xquartz'
cask 'nordvpn'
cask 'disk-inventory-x'
cask 'musicbrainz-picard'
cask 'openoffice'
cask 'google-chrome'
cask 'the-unarchiver'
cask 'vlc'
cask 'dropbox'
cask 'keepingyouawake'
cask 'atom'
cask 'itsycal'

# Video
brew 'handbrake'
brew 'ffmpeg', args: ['with-fdk-aac']
brew 'mkvtoolnix'
brew 'mp4v2'
brew 'mpv'


# MAS stuff
# mas '1Password', id: 443987910
mas '1Password 7', id: 1333542190
mas 'Tweetbot 3 for Twitter', id: 1384080005
mas 'Yoink', id: 457622435
